/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   so_long.h                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lloko <lloko@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/07 15:22:32 by lloko             #+#    #+#             */
/*   Updated: 2022/04/16 21:14:16 by lloko            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef SO_LONG_H
# define SO_LONG_H

# include "gnl/get_next_line.h"
# include "printf/printf.h"

typedef struct	readmap
{
	int	height;
	int	weight;
	int	player; /*определить позицию игрока */
	int	score; /*определить сколько колекционных предметов есть на карте */
	int	coll; /* вначале игры будет 0, то количество предметов которые мы собрали в игре */
	char **mapgnl; /*чтение карты в двумерный массив */
};

#endif
